function solution(k, rates) {
  let Money = k;
  let isBuy = false;

  for (let i = 0; i < rates.length - 1; i++) {
    let curR = rates[i];
    let nextR = rates[i + 1];
    // console.log([Money, curR, nextR])

    // 1. 내일 환율 올라가면
    // 1.1 안샀으면 오늘 산다.
    // 1.2 이미 샀으면 keep
    if (curR <= nextR) {
      if (!isBuy) {
        if (Money < curR) continue;
        Money -= curR;
        isBuy = true;
      } else {
        continue;
      }
    }

    // 2.내일 환율 떨어지면
    // 1.1 산게 있으면 오늘 판다,
    // 1.2 없다면 keep
    if (curR > nextR) {
      if (isBuy) {
        Money += curR;
        isBuy = false;
      } else {
        continue;
      }
    }
  }
  // 마지막날 산게 남았다면 판다.
  if (isBuy) {
    Money += rates[rates.length - 1];
  }
  return Money;
}
/*문제 설명
매일매일의 환율 변화가 담긴 배열을 이용해 가상 환율 투자를 해보려 합니다. 환율은 원달러 환율을 나타내며, 1달러를 사는데 필요한 원화(KRW)의 가격을 의미합니다. 즉, $1 = ₩1000 이라면 1달러를 사는데 1000원이 필요하다는 의미입니다. 예를 들어 $1 = ₩1000일때 1달러를 사고, $1 = ₩1100일때 1달러를 판다면 100원의 이익을 낼 수 있습니다.

이때, 아래와 같은 규칙을 지키면서 가상 환율 투자를 해야합니다.

초기 금액 k원으로 시작합니다.
환전은 1달러 단위로만 가능합니다.
하루에 최대 1달러만 살 수 있으며, 최대 1달러만 가지고 있을 수 있습니다.
3-1. 즉, 1달러를 산 후에는 가지고있는 1달러를 팔기 전에는 달러를 더 구매할 수 없습니다.
가지고 있을 수 있는 원화에는 제한이 없습니다.
다음은 초기금액 k = ₩1000일 때 10일 동안의 환율 변화와 가상 환율 투자를 했을 경우의 이익을 최대화 하는 예시입니다. 환율은 1달러를 사기 위해 필요한 원화가격을 나타냅니다.

날짜	환율	달러	원화	설명
1	1200	0	1000	가지고 있는 원화로 1달러를 살 수 없습니다.
2	1000	1	0	1000원으로 1달러를 삽니다.
3	1100	1	0	-
4	1200	0	1200	1달러를 1200원에 팝니다.
5	900	1	300	1달러를 900원에 삽니다.
6	1000	1	300	-
7	1500	0	1800	1달러를 1500원에 팝니다.
8	900	0	1800	-
9	750	1	1050	1달러를 750원에 삽니다.
10	1100	0	2150	1달러를 1100원에 팝니다.
따라서 초기금액 1000원에서 최대 2150원을 만들 수 있습니다.

초기금액 k원, 매일매일의 환율 변화가 담긴 배열 rates가 매개변수로 주어질 때, 초기 금액에서 만들 수 있는 최대 금액을 return 하도록 solution 함수를 완성해주세요.

제한사항
k는 1 이상 100,000 이하인 자연수입니다.
rates의 길이는 1 이상 100,000 이하입니다.
rates의 원소는 1 이상 10,000 이하인 자연수입니다.
rates의 원소는 1달러를 사기 위해 필요한 원화가격을 나타냅니다.
이익을 낼 수 없는 경우에는 초기금액 k를 그대로 return 하면 됩니다.
입출력 예
k	rates	result
1000	[1200, 1000, 1100, 1200, 900, 1000, 1500, 900, 750, 1100]	2150
1500	[1500, 1400, 1300, 1200]	1500
입출력 예 설명
입출력 예 #1

문제의 예시와 같습니다.

입출력 예 #2

환율이 계속 내려가므로 이익을 낼 수 없습니다. */
