// 문제
// 현민이는 게임 캐릭터가 맵 안에서 움직이는 시스템을 개발 중이다.
// 캐릭터가 있는 장소는 1 x 1 크기의 정사각형으로 이뤄진 N x M 크기의 직사각형으로, 각각의 칸은 육지 또는 바다이다.
// 캐릭터는 동서남북 중 한 곳을 바라본다.

// 맵의 각 칸은 (A, B)로 나타낼 수 있고, A는 북쪽으로부터 떨어진 칸의 개수, B는 서쪽으로부터 떨어진 칸의 개수이다.
// 캐릭터는 상하좌우로 움직일 수 있고, 바다로 되어 있는 공간에는 갈 수 없다.
// 캐릭터의 움직임을 설정하기 위해 정해 놓은 매뉴얼은 이러하다.

// 1. 현재 위치에서 현재 방향을 기준으로 왼쪽 방향(반시계 방향으로 90도 회전한 방향)부터 차례대로 갈 곳을 정한다.
// 2. 캐릭터의 바로 왼쪽 방향에 아직 가보지 않은 칸이 존재한다면, 왼쪽 방향으로 회전한 다음 왼쪽으로 한 칸을 전진한다.
// 왼쪽 방향에 가보지 않은 칸이 없다면, 왼쪽 방향으로 회전만 수행하고 1단계로 돌아간다.
// 3. 만약 네 방향 모두 이미 가본 칸이거나 바다로 되어 있는 칸인 경우에는, 바라보는 방향을 유지한 채로 한 칸 뒤로 가고 1단계로 돌아간다.
// 단, 이때 뒤쪽 방향이 바다인 칸이라 뒤로 갈 수 없는 경우에는 움직임을 멈춘다.

// 캐릭터가 방문한 칸의 수를 출력해라!

// 입력
// 첫째 줄 : 맵의 세로크기 N, 가로크기 M (3 <= N, M <= 50)
// 둘째 줄 : 게임 캐릭터가 있는 칸의 좌표(A, B)와 바라보는 방향 d (0: 북쪽, 1: 동쪽, 2:남쪽, 3:서쪽)
// 셋째 줄부터 맵이 육지인지 바다인지 정보가 주어진다 (0: 육지, 1: 바다)

function solution(input) {
  let [N, M] = input.shift();
  let [A, B, d] = input.shift();
  const map = input.shift();
  const visit = Array(N)
    .fill(0)
    .map(() => Array(M).fill(0));
  visit[B][A] = 1;

  // 북, 동, 남, 서
  const dx = [0, 1, 0, -1];
  const dy = [-1, 0, 1, 0];

  const turnLeft = () => {
    if (d === 0) {
      d = 3;
    } else {
      d--;
    }
  };

  // map => 1 : 바다, 0 : 육지
  // visit => 1: 방문한 곳, 0 : 방문하지 않은 곳
  let answer = 1;
  let turn_count = 0;

  while (true) {
    turnLeft();
    let nx = A + dx[d];
    let ny = B + dy[d];

    if (map[ny][nx] === 0 && visit[ny][nx] === 0) {
      visit[ny][nx] = 1;
      A = nx;
      B = ny;
      answer++;
      turn_count = 0;
      continue;
    } else {
      turn_count++;
    }

    if (turn_count === 4) {
      nx = A - dx[d];
      ny = B - dy[d];
      if (map[ny][nx] === 0) {
        A = nx;
        B = ny;
      } else {
        break;
      }
      turn_count = 0;
    }
  }

  return answer;
}

console.log(
  solution([
    [4, 4],
    [1, 1, 0],
    [
      [1, 1, 1, 1],
      [1, 0, 0, 1],
      [1, 1, 0, 1],
      [1, 1, 1, 1],
    ],
  ])
);
